Revit 2024 API
PolylineSegments.IsFilled Property
 Indicates whether the area enclosed by the polyline is to be filled or not.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool IsFilled { get; }
Visual Basic
Public ReadOnly Property IsFilled As Boolean
	Get
Visual C++
public:
property bool IsFilled {
	bool get ();
}
See Also
PolylineSegments Class
Autodesk.Revit.DB Namespace